# in this repo we are going to load sql table into pandas

In [ ]:
module required:sqlalchemy,pandas

In [17]:
from sqlalchemy import create_engine,

In [2]:
import sys

In [3]:
sys.path

[u'/tmp/spark-c484ce87-8e04-45c9-b496-7565e21b5f96/userFiles-95f1cd50-c277-4005-919d-f3899bc1eaf9',
 '',
 '/home/somanath/spark/spark-2.2.0-bin-hadoop2.7/python/lib/py4j-0.10.4-src.zip',
 '/home/somanath/spark/spark-2.2.0-bin-hadoop2.7/python',
 '/home/somanath',
 '/home/somanath/anaconda2/lib/python27.zip',
 '/home/somanath/anaconda2/lib/python2.7',
 '/home/somanath/anaconda2/lib/python2.7/plat-linux2',
 '/home/somanath/anaconda2/lib/python2.7/lib-tk',
 '/home/somanath/anaconda2/lib/python2.7/lib-old',
 '/home/somanath/anaconda2/lib/python2.7/lib-dynload',
 '/home/somanath/anaconda2/lib/python2.7/site-packages',
 '/home/somanath/anaconda2/lib/python2.7/site-packages/Mako-1.0.7-py2.7.egg',
 '/home/somanath/anaconda2/lib/python2.7/site-packages/IPython/extensions',
 '/home/somanath/.ipython']

In [7]:
#sqlalchemy used for connecting db with python

In [39]:
engine=create_engine('mysql+mysqlconnector://root:pwd@localhost:3306/hadoop',)

In [21]:
metadata=MetaData(engine)

In [23]:
import sqlalchemy as db

# reading table from mysql

In [42]:

table_list=pd.read_sql("show tables",engine)

In [35]:
import pandas as pd

In [41]:
employee=pd.read_sql("select * from employee",engine)

In [43]:
table_list

  Tables_in_hadoop
0         employee
1        employee2
2        employee3
3      studentinfo
4       word_count
5        wordcount
6    wordcountinfo
7     wordcountopt

In [44]:
employee

    Emp_id  Emp_name         Dept_name Emp_sal
0        1  somanath  hadoop_developer   10000
1        2    suresh  hadoop_developer   10000
2        3     aresh  hadoop_developer   20000
3        4    naresh  hadoop_developer   30000
4        5    maresh  hadoop_developer   40000
5        6     aresh  hadoop_developer    5000
6        7    haresh  hadoop_developer   60000
7        8    murush  hadoop_developer   21100
8        9   prakash  hadoop_developer   20000
9       10      shaw  hadoop_developer    2300
10      11    mahesh  hadoop_developer   20000
11      12  paramesh  hadoop_developer   20000
12      13    ramesh  hadoop_developer   20000
13      14      modi  hadoop_developer   20000
14      15       ops  hadoop_developer   20000

# today mission accomplished